# coordinates.py
kanji_coordinates = {
       # 姓英语
     'name1': {
        'x': 280,     
        'y': 625    
    },
    # 名英语
     'name2': {
        'x': 380,     
        'y': 625   
    },
    # 姓汉字
     'name3': {
        'x': 300,     
        'y': 558    
    },
    # 名汉字
     'name4': {
        'x': 400,     
        'y': 558
    },

    # 性别男
     'malex': {
        'x': 109,     
        'y': 540,
        'size':7
    },
    # 性别女
     'maley': {
        'x': 167,     
        'y': 540,
        'size':7
    },
    # 出生日期
     'age': {
        'x': 510,     
        'y': 665
    },
    # 国籍
     'nation': {
        'x': 220,     
        'y': 657,
    },

     # 家庭电话
     'family_tel': {
        'x': 220,     
        'y': 149,
    }, 
     # 家庭手机
     'family_phone': {
        'x': 500,     
        'y': 147,
    }, 
    # 圆的参数


}
saikoufu_coordinates = {
     
    # 国籍
     'nation': {
        'x': 230,     
        'y': 617,
    },
      # 姓英语
     'name11': {
        'x': 300,     
        'y': 580    
    },
    # 名英语
     'name22': {
        'x': 350,     
        'y': 580 
    },
    # 姓汉字
     'name33': {
        'x': 180,     
        'y': 580  
    },
    # 名汉字
     'name44': {
        'x': 240,     
        'y': 580
    },

    # 性别男
     'malex': {
        'x': 516,     
        'y': 592,
        'size':7
    },
    # 性别女
     'maley': {
        'x': 545,     
        'y': 592,
        'size':7
    },
    # 出生日期
     'age': {
        'x': 520,     
        'y': 623
    },
 
     # 理由
     'liyou': {
        'x': 310,     
        'y': 472,
    },
         # 在留
     'zairyuid': {
        'x': 285,     
        'y': 527,
    },
    
         # 地址
     'address': {
        'x': 430,     
        'y': 553,
    },

     # 家庭电话
     'family_tel': {
        'x': 230,     
        'y': 168,
    }, 
     # 家庭手机
     'family_phone': {
        'x': 510,     
        'y': 168,
    }, 
    # 圆的参数


}

iseifu_coordinates = {
     
    # id
     'id1': {
        'x': 500,     
        'y': 690,
    },
       # id2
     'id2': {
        'x': 180,     
        'y': 566,
    },
     # name
     'name': {
        'x': 162,     
        'y': 527,
    },
    #cose
     'cose': {
        'x': 206,     
        'y': 408,
    },
      #cose
     'cose2': {
        'x': 392,     
        'y': 408,
    },
          #～
     'year_year': {
        'x': 260,     
        'y': 382,
    },

    #start
     'start': {
        'x':247,     
        'y': 382,
    },
        #end
     'end': {
        'x': 320,     
        'y': 382,
    },
    #year
     'year': {
        'x':180,     
        'y': 235,
    },

}